_posts/2020-08-08-first_post.html
---
layout: blogpost
title: Welcome to my blog!
tags: info
---

<p>
And so it begins! This is the first post of my new blog. I thought this first post could be about my goals, as well as the topics I intend to write about. Just so you know what to expect, given that you read this before I have managed write more&#x2026;
</p>

<div id="outline-container-org19494db" class="outline-2">
<h2 id="org19494db">Goals</h2>
<div class="outline-text-2" id="text-org19494db">
<p>
I had several goals when creating this blog, but the most important one was to have a place where I could write about the things that I find interesting. As you might have guessed, this is mostly related to computers. I LOVE computers! Not just programming, but the wonders that computers can do, and the achievement of the great individuals who have made it possible. 
</p>

<p>
I would summarize my goals as follows:
</p>
<ul class="org-ul">
<li>Being able to blog from Org mode in Emacs (super important!)</li>
<li>Having a place that could be in-part a diary about things I learn (and small projects), one part my private online journal for articles, and more. The gist of it is to do more writing, which I take a lot of pleasure in doing :) (beware that English is not my first language though&#x2026;)</li>
<li>Having a simple design that will not get in the way of reading my articles. I'm intending to gradually improve it as I go, I know it is far from perfect! I dub this current design Terriblé.</li>
<li>Maybe having a simple CI/CI pipeline to be able to play with Github Actions (secondary, but already in place :) ).</li>
</ul>
</div>
</div>


<div id="outline-container-orga16db04" class="outline-2">
<h2 id="orga16db04">What will I write about?</h2>
<div class="outline-text-2" id="text-orga16db04">
<p>
I plan to mostly write about computer related topics, with a dash of math and book recommendations on top (though mostly relating to computers or math&#x2026;). Some other topics may also come up from time to time. 
</p>
</div>
</div>


<div id="outline-container-org2261339" class="outline-2">
<h2 id="org2261339">So&#x2026;</h2>
<div class="outline-text-2" id="text-org2261339">
<p>
What will the future show? Who knows. The only answer will be in the undiscovered country, the future!
</p>
</div>
</div>
